Thank you for your details. I tried to reproduce the problem based on your description. I created 150 VLAN interfaces on the FortiLink-based RTR_LINK in VDOM FGT_RTR.

**1 First set up the FortiLink interface and VDOM**:

![555](https://user-images.githubusercontent.com/49291382/98431287-e3239f80-20ee-11eb-99ac-25c2f13c5843.png)



**2 Prepare to create 150 interfaces. The terraform configuration is as follows(I didn't use terraform for_each in order to try to match you configuration as much as possible):**
```

provider "fortios" {
  hostname = "10.160.21.144"
  insecure = "true"
  token    = "ynypsNq8Hzs7dnff3NqjmwNQQ6pmhf"
  vdom     = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_1" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_1"
  status    = "up"
  type      = "vlan"
  vlanid    = 1
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_2" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_2"
  status    = "up"
  type      = "vlan"
  vlanid    = 2
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_3" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_3"
  status    = "up"
  type      = "vlan"
  vlanid    = 3
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_4" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_4"
  status    = "up"
  type      = "vlan"
  vlanid    = 4
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_5" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_5"
  status    = "up"
  type      = "vlan"
  vlanid    = 5
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_6" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_6"
  status    = "up"
  type      = "vlan"
  vlanid    = 6
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_7" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_7"
  status    = "up"
  type      = "vlan"
  vlanid    = 7
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_8" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_8"
  status    = "up"
  type      = "vlan"
  vlanid    = 8
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_9" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_9"
  status    = "up"
  type      = "vlan"
  vlanid    = 9
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_10" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_10"
  status    = "up"
  type      = "vlan"
  vlanid    = 10
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_11" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_11"
  status    = "up"
  type      = "vlan"
  vlanid    = 11
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_12" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_12"
  status    = "up"
  type      = "vlan"
  vlanid    = 12
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_13" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_13"
  status    = "up"
  type      = "vlan"
  vlanid    = 13
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_14" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_14"
  status    = "up"
  type      = "vlan"
  vlanid    = 14
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_15" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_15"
  status    = "up"
  type      = "vlan"
  vlanid    = 15
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_16" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_16"
  status    = "up"
  type      = "vlan"
  vlanid    = 16
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_17" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_17"
  status    = "up"
  type      = "vlan"
  vlanid    = 17
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_18" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_18"
  status    = "up"
  type      = "vlan"
  vlanid    = 18
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_19" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_19"
  status    = "up"
  type      = "vlan"
  vlanid    = 19
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_20" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_20"
  status    = "up"
  type      = "vlan"
  vlanid    = 20
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_21" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_21"
  status    = "up"
  type      = "vlan"
  vlanid    = 21
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_22" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_22"
  status    = "up"
  type      = "vlan"
  vlanid    = 22
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_23" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_23"
  status    = "up"
  type      = "vlan"
  vlanid    = 23
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_24" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_24"
  status    = "up"
  type      = "vlan"
  vlanid    = 24
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_25" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_25"
  status    = "up"
  type      = "vlan"
  vlanid    = 25
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_26" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_26"
  status    = "up"
  type      = "vlan"
  vlanid    = 26
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_27" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_27"
  status    = "up"
  type      = "vlan"
  vlanid    = 27
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_28" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_28"
  status    = "up"
  type      = "vlan"
  vlanid    = 28
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_29" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_29"
  status    = "up"
  type      = "vlan"
  vlanid    = 29
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_30" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_30"
  status    = "up"
  type      = "vlan"
  vlanid    = 30
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_31" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_31"
  status    = "up"
  type      = "vlan"
  vlanid    = 31
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_32" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_32"
  status    = "up"
  type      = "vlan"
  vlanid    = 32
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_33" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_33"
  status    = "up"
  type      = "vlan"
  vlanid    = 33
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_34" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_34"
  status    = "up"
  type      = "vlan"
  vlanid    = 34
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_35" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_35"
  status    = "up"
  type      = "vlan"
  vlanid    = 35
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_36" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_36"
  status    = "up"
  type      = "vlan"
  vlanid    = 36
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_37" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_37"
  status    = "up"
  type      = "vlan"
  vlanid    = 37
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_38" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_38"
  status    = "up"
  type      = "vlan"
  vlanid    = 38
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_39" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_39"
  status    = "up"
  type      = "vlan"
  vlanid    = 39
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_40" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_40"
  status    = "up"
  type      = "vlan"
  vlanid    = 40
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_41" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_41"
  status    = "up"
  type      = "vlan"
  vlanid    = 41
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_42" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_42"
  status    = "up"
  type      = "vlan"
  vlanid    = 42
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_43" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_43"
  status    = "up"
  type      = "vlan"
  vlanid    = 43
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_44" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_44"
  status    = "up"
  type      = "vlan"
  vlanid    = 44
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_45" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_45"
  status    = "up"
  type      = "vlan"
  vlanid    = 45
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_46" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_46"
  status    = "up"
  type      = "vlan"
  vlanid    = 46
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_47" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_47"
  status    = "up"
  type      = "vlan"
  vlanid    = 47
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_48" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_48"
  status    = "up"
  type      = "vlan"
  vlanid    = 48
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_49" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_49"
  status    = "up"
  type      = "vlan"
  vlanid    = 49
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_50" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_50"
  status    = "up"
  type      = "vlan"
  vlanid    = 50
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_51" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_51"
  status    = "up"
  type      = "vlan"
  vlanid    = 51
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_52" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_52"
  status    = "up"
  type      = "vlan"
  vlanid    = 52
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_53" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_53"
  status    = "up"
  type      = "vlan"
  vlanid    = 53
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_54" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_54"
  status    = "up"
  type      = "vlan"
  vlanid    = 54
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_55" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_55"
  status    = "up"
  type      = "vlan"
  vlanid    = 55
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_56" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_56"
  status    = "up"
  type      = "vlan"
  vlanid    = 56
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_57" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_57"
  status    = "up"
  type      = "vlan"
  vlanid    = 57
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_58" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_58"
  status    = "up"
  type      = "vlan"
  vlanid    = 58
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_59" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_59"
  status    = "up"
  type      = "vlan"
  vlanid    = 59
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_60" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_60"
  status    = "up"
  type      = "vlan"
  vlanid    = 60
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_61" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_61"
  status    = "up"
  type      = "vlan"
  vlanid    = 61
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_62" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_62"
  status    = "up"
  type      = "vlan"
  vlanid    = 62
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_63" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_63"
  status    = "up"
  type      = "vlan"
  vlanid    = 63
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_64" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_64"
  status    = "up"
  type      = "vlan"
  vlanid    = 64
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_65" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_65"
  status    = "up"
  type      = "vlan"
  vlanid    = 65
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_66" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_66"
  status    = "up"
  type      = "vlan"
  vlanid    = 66
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_67" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_67"
  status    = "up"
  type      = "vlan"
  vlanid    = 67
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_68" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_68"
  status    = "up"
  type      = "vlan"
  vlanid    = 68
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_69" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_69"
  status    = "up"
  type      = "vlan"
  vlanid    = 69
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_70" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_70"
  status    = "up"
  type      = "vlan"
  vlanid    = 70
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_71" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_71"
  status    = "up"
  type      = "vlan"
  vlanid    = 71
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_72" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_72"
  status    = "up"
  type      = "vlan"
  vlanid    = 72
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_73" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_73"
  status    = "up"
  type      = "vlan"
  vlanid    = 73
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_74" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_74"
  status    = "up"
  type      = "vlan"
  vlanid    = 74
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_75" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_75"
  status    = "up"
  type      = "vlan"
  vlanid    = 75
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_76" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_76"
  status    = "up"
  type      = "vlan"
  vlanid    = 76
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_77" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_77"
  status    = "up"
  type      = "vlan"
  vlanid    = 77
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_78" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_78"
  status    = "up"
  type      = "vlan"
  vlanid    = 78
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_79" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_79"
  status    = "up"
  type      = "vlan"
  vlanid    = 79
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_80" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_80"
  status    = "up"
  type      = "vlan"
  vlanid    = 80
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_81" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_81"
  status    = "up"
  type      = "vlan"
  vlanid    = 81
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_82" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_82"
  status    = "up"
  type      = "vlan"
  vlanid    = 82
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_83" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_83"
  status    = "up"
  type      = "vlan"
  vlanid    = 83
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_84" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_84"
  status    = "up"
  type      = "vlan"
  vlanid    = 84
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_85" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_85"
  status    = "up"
  type      = "vlan"
  vlanid    = 85
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_86" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_86"
  status    = "up"
  type      = "vlan"
  vlanid    = 86
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_87" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_87"
  status    = "up"
  type      = "vlan"
  vlanid    = 87
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_88" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_88"
  status    = "up"
  type      = "vlan"
  vlanid    = 88
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_89" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_89"
  status    = "up"
  type      = "vlan"
  vlanid    = 89
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_90" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_90"
  status    = "up"
  type      = "vlan"
  vlanid    = 90
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_91" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_91"
  status    = "up"
  type      = "vlan"
  vlanid    = 91
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_92" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_92"
  status    = "up"
  type      = "vlan"
  vlanid    = 92
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_93" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_93"
  status    = "up"
  type      = "vlan"
  vlanid    = 93
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_94" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_94"
  status    = "up"
  type      = "vlan"
  vlanid    = 94
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_95" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_95"
  status    = "up"
  type      = "vlan"
  vlanid    = 95
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_96" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_96"
  status    = "up"
  type      = "vlan"
  vlanid    = 96
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_97" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_97"
  status    = "up"
  type      = "vlan"
  vlanid    = 97
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_98" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_98"
  status    = "up"
  type      = "vlan"
  vlanid    = 98
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_99" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_99"
  status    = "up"
  type      = "vlan"
  vlanid    = 99
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_100" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_100"
  status    = "up"
  type      = "vlan"
  vlanid    = 100
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_101" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_101"
  status    = "up"
  type      = "vlan"
  vlanid    = 101
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_102" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_102"
  status    = "up"
  type      = "vlan"
  vlanid    = 102
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_103" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_103"
  status    = "up"
  type      = "vlan"
  vlanid    = 103
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_104" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_104"
  status    = "up"
  type      = "vlan"
  vlanid    = 104
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_105" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_105"
  status    = "up"
  type      = "vlan"
  vlanid    = 105
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_106" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_106"
  status    = "up"
  type      = "vlan"
  vlanid    = 106
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_107" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_107"
  status    = "up"
  type      = "vlan"
  vlanid    = 107
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_108" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_108"
  status    = "up"
  type      = "vlan"
  vlanid    = 108
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_109" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_109"
  status    = "up"
  type      = "vlan"
  vlanid    = 109
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_110" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_110"
  status    = "up"
  type      = "vlan"
  vlanid    = 110
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_111" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_111"
  status    = "up"
  type      = "vlan"
  vlanid    = 111
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_112" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_112"
  status    = "up"
  type      = "vlan"
  vlanid    = 112
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_113" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_113"
  status    = "up"
  type      = "vlan"
  vlanid    = 113
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_114" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_114"
  status    = "up"
  type      = "vlan"
  vlanid    = 114
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_115" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_115"
  status    = "up"
  type      = "vlan"
  vlanid    = 115
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_116" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_116"
  status    = "up"
  type      = "vlan"
  vlanid    = 116
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_117" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_117"
  status    = "up"
  type      = "vlan"
  vlanid    = 117
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_118" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_118"
  status    = "up"
  type      = "vlan"
  vlanid    = 118
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_119" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_119"
  status    = "up"
  type      = "vlan"
  vlanid    = 119
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_120" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_120"
  status    = "up"
  type      = "vlan"
  vlanid    = 120
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_121" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_121"
  status    = "up"
  type      = "vlan"
  vlanid    = 121
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_122" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_122"
  status    = "up"
  type      = "vlan"
  vlanid    = 122
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_123" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_123"
  status    = "up"
  type      = "vlan"
  vlanid    = 123
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_124" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_124"
  status    = "up"
  type      = "vlan"
  vlanid    = 124
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_125" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_125"
  status    = "up"
  type      = "vlan"
  vlanid    = 125
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_126" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_126"
  status    = "up"
  type      = "vlan"
  vlanid    = 126
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_127" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_127"
  status    = "up"
  type      = "vlan"
  vlanid    = 127
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_128" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_128"
  status    = "up"
  type      = "vlan"
  vlanid    = 128
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_129" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_129"
  status    = "up"
  type      = "vlan"
  vlanid    = 129
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_130" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_130"
  status    = "up"
  type      = "vlan"
  vlanid    = 130
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_131" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_131"
  status    = "up"
  type      = "vlan"
  vlanid    = 131
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_132" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_132"
  status    = "up"
  type      = "vlan"
  vlanid    = 132
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_133" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_133"
  status    = "up"
  type      = "vlan"
  vlanid    = 133
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_134" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_134"
  status    = "up"
  type      = "vlan"
  vlanid    = 134
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_135" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_135"
  status    = "up"
  type      = "vlan"
  vlanid    = 135
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_136" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_136"
  status    = "up"
  type      = "vlan"
  vlanid    = 136
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_137" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_137"
  status    = "up"
  type      = "vlan"
  vlanid    = 137
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_138" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_138"
  status    = "up"
  type      = "vlan"
  vlanid    = 138
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_139" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_139"
  status    = "up"
  type      = "vlan"
  vlanid    = 139
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_140" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_140"
  status    = "up"
  type      = "vlan"
  vlanid    = 140
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_141" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_141"
  status    = "up"
  type      = "vlan"
  vlanid    = 141
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_142" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_142"
  status    = "up"
  type      = "vlan"
  vlanid    = 142
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_143" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_143"
  status    = "up"
  type      = "vlan"
  vlanid    = 143
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_144" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_144"
  status    = "up"
  type      = "vlan"
  vlanid    = 144
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_145" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_145"
  status    = "up"
  type      = "vlan"
  vlanid    = 145
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_146" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_146"
  status    = "up"
  type      = "vlan"
  vlanid    = 146
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_147" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_147"
  status    = "up"
  type      = "vlan"
  vlanid    = 147
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_148" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_148"
  status    = "up"
  type      = "vlan"
  vlanid    = 148
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_149" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_149"
  status    = "up"
  type      = "vlan"
  vlanid    = 149
  vdom      = "FGT_RTR"
}

resource "fortios_system_interface" "VLAN_RTR_150" {
  color     = 0
  interface = "RTR_LINK"
  ip        = "0.0.0.0 0.0.0.0"
  name      = "VLAN_RTR_150"
  status    = "up"
  type      = "vlan"
  vlanid    = 150
  vdom      = "FGT_RTR"
}


```




**3 Execute terraform apply:**

```
# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_interface.VLAN_RTR_1 will be created
  + resource "fortios_system_interface" "VLAN_RTR_1" {
      + ac_name                                    = (known after apply)
      + aggregate                                  = (known after apply)
      + algorithm                                  = (known after apply)
      + alias                                      = (known after apply)
      + allowaccess                                = (known after apply)
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = (known after apply)
      + bfd                                        = (known after apply)
      + bfd_desired_min_tx                         = (known after apply)
      + bfd_detect_mult                            = (known after apply)
      + bfd_required_min_rx                        = (known after apply)
      + broadcast_forticlient_discovery            = (known after apply)
      + broadcast_forward                          = (known after apply)


..............
..............
..............


  # fortios_system_interface.VLAN_RTR_99 will be created
  + resource "fortios_system_interface" "VLAN_RTR_99" {
      + ac_name                                    = (known after apply)
      + aggregate                                  = (known after apply)
      + algorithm                                  = (known after apply)
      + alias                                      = (known after apply)
      + allowaccess                                = (known after apply)
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = (known after apply)
      + bfd                                        = (known after apply)
      + bfd_desired_min_tx                         = (known after apply)
      + bfd_detect_mult                            = (known after apply)
      + bfd_required_min_rx                        = (known after apply)
      + broadcast_forticlient_discovery            = (known after apply)
      + broadcast_forward                          = (known after apply)
      + captive_portal                             = (known after apply)
      + cli_conn_status                            = (known after apply)
      + color                                      = 0
      + dedicated_to                               = (known after apply)
      + defaultgw                                  = (known after apply)
      + detected_peer_mtu                          = (known after apply)
      + detectprotocol                             = (known after apply)
      + detectserver                               = (known after apply)
      + device_access_list                         = (known after apply)
      + device_identification                      = (known after apply)
      + device_identification_active_scan          = (known after apply)
      + device_netscan                             = (known after apply)
      + device_user_identification                 = (known after apply)
      + devindex                                   = (known after apply)
      + dhcp_client_identifier                     = (known after apply)
      + dhcp_relay_agent_option                    = (known after apply)
      + dhcp_relay_ip                              = (known after apply)
      + dhcp_relay_service                         = (known after apply)
      + dhcp_relay_type                            = (known after apply)
      + dhcp_renew_time                            = (known after apply)
      + disc_retry_timeout                         = (known after apply)
      + disconnect_threshold                       = (known after apply)
      + distance                                   = (known after apply)
      + dns_server_override                        = (known after apply)
      + drop_fragment                              = (known after apply)
      + drop_overlapped_fragment                   = (known after apply)
      + egress_shaping_profile                     = (known after apply)
      + endpoint_compliance                        = (known after apply)
      + estimated_downstream_bandwidth             = (known after apply)
      + estimated_upstream_bandwidth               = (known after apply)
      + explicit_ftp_proxy                         = (known after apply)
      + explicit_web_proxy                         = (known after apply)
      + external                                   = (known after apply)
      + fail_action_on_extender                    = (known after apply)
      + fail_alert_method                          = (known after apply)
      + fail_detect                                = (known after apply)
      + fail_detect_option                         = (known after apply)
      + fortiheartbeat                             = (known after apply)
      + fortilink                                  = (known after apply)
      + fortilink_backup_link                      = (known after apply)
      + fortilink_split_interface                  = (known after apply)
      + fortilink_stacking                         = (known after apply)
      + forward_domain                             = (known after apply)
      + gwdetect                                   = (known after apply)
      + ha_priority                                = (known after apply)
      + icmp_accept_redirect                       = (known after apply)
      + icmp_send_redirect                         = (known after apply)
      + id                                         = (known after apply)
      + ident_accept                               = (known after apply)
      + idle_timeout                               = (known after apply)
      + inbandwidth                                = (known after apply)
      + ingress_spillover_threshold                = (known after apply)
      + interface                                  = "RTR_LINK"
      + internal                                   = (known after apply)
      + ip                                         = "0.0.0.0 0.0.0.0"
      + ipmac                                      = (known after apply)
      + ips_sniffer_mode                           = (known after apply)
      + ipunnumbered                               = (known after apply)
      + l2forward                                  = (known after apply)
      + lacp_ha_slave                              = (known after apply)
      + lacp_mode                                  = (known after apply)
      + lacp_speed                                 = (known after apply)
      + lcp_echo_interval                          = (known after apply)
      + lcp_max_echo_fails                         = (known after apply)
      + link_up_delay                              = (known after apply)
      + lldp_network_policy                        = (known after apply)
      + lldp_reception                             = (known after apply)
      + lldp_transmission                          = (known after apply)
      + macaddr                                    = (known after apply)
      + management_ip                              = (known after apply)
      + min_links                                  = (known after apply)
      + min_links_down                             = (known after apply)
      + mode                                       = (known after apply)
      + mtu                                        = (known after apply)
      + mtu_override                               = (known after apply)
      + name                                       = "VLAN_RTR_99"
      + ndiscforward                               = (known after apply)
      + netbios_forward                            = (known after apply)
      + netflow_sampler                            = (known after apply)
      + outbandwidth                               = (known after apply)
      + padt_retry_timeout                         = (known after apply)
      + ping_serv_status                           = (known after apply)
      + polling_interval                           = (known after apply)
      + pppoe_unnumbered_negotiate                 = (known after apply)
      + pptp_auth_type                             = (known after apply)
      + pptp_client                                = (known after apply)
      + pptp_server_ip                             = (known after apply)
      + pptp_timeout                               = (known after apply)
      + pptp_user                                  = (known after apply)
      + preserve_session_route                     = (known after apply)
      + priority                                   = (known after apply)
      + priority_override                          = (known after apply)
      + proxy_captive_portal                       = (known after apply)
      + redundant_interface                        = (known after apply)
      + remote_ip                                  = (known after apply)
      + replacemsg_override_group                  = (known after apply)
      + role                                       = (known after apply)
      + sample_direction                           = (known after apply)
      + sample_rate                                = (known after apply)
      + scan_botnet_connections                    = (known after apply)
      + secondary_ip                               = (known after apply)
      + security_exempt_list                       = (known after apply)
      + security_external_logout                   = (known after apply)
      + security_external_web                      = (known after apply)
      + security_mac_auth_bypass                   = (known after apply)
      + security_mode                              = (known after apply)
      + security_redirect_url                      = (known after apply)
      + service_name                               = (known after apply)
      + sflow_sampler                              = (known after apply)
      + snmp_index                                 = (known after apply)
      + speed                                      = (known after apply)
      + spillover_threshold                        = (known after apply)
      + src_check                                  = (known after apply)
      + status                                     = "up"
      + stpforward                                 = (known after apply)
      + stpforward_mode                            = (known after apply)
      + subst                                      = (known after apply)
      + substitute_dst_mac                         = (known after apply)
      + switch                                     = (known after apply)
      + switch_controller_access_vlan              = (known after apply)
      + switch_controller_arp_inspection           = (known after apply)
      + switch_controller_dhcp_snooping            = (known after apply)
      + switch_controller_dhcp_snooping_option82   = (known after apply)
      + switch_controller_dhcp_snooping_verify_mac = (known after apply)
      + switch_controller_igmp_snooping            = (known after apply)
      + switch_controller_learning_limit           = (known after apply)
      + switch_controller_traffic_policy           = (known after apply)
      + tcp_mss                                    = (known after apply)
      + trust_ip6_1                                = (known after apply)
      + trust_ip6_2                                = (known after apply)
      + trust_ip6_3                                = (known after apply)
      + trust_ip_1                                 = (known after apply)
      + trust_ip_2                                 = (known after apply)
      + trust_ip_3                                 = (known after apply)
      + type                                       = "vlan"
      + username                                   = (known after apply)
      + vdom                                       = "FGT_RTR"
      + vindex                                     = (known after apply)
      + vlanforward                                = (known after apply)
      + vlanid                                     = 79
      + vrf                                        = (known after apply)
      + vrrp_virtual_mac                           = (known after apply)
      + wccp                                       = (known after apply)
      + weight                                     = (known after apply)
      + wins_ip                                    = (known after apply)
    }

Plan: 150 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_interface.VLAN_RTR_44: Creating...
fortios_system_interface.VLAN_RTR_42: Creating...
fortios_system_interface.VLAN_RTR_66: Creating...
fortios_system_interface.VLAN_RTR_20: Creating...
fortios_system_interface.VLAN_RTR_69: Creating...
fortios_system_interface.VLAN_RTR_104: Creating...
fortios_system_interface.VLAN_RTR_24: Creating...
fortios_system_interface.VLAN_RTR_82: Creating...
fortios_system_interface.VLAN_RTR_150: Creating...
fortios_system_interface.VLAN_RTR_17: Creating...
fortios_system_interface.VLAN_RTR_44: Creation complete after 1s [id=VLAN_RTR_44]
fortios_system_interface.VLAN_RTR_100: Creating...
fortios_system_interface.VLAN_RTR_69: Creation complete after 1s [id=VLAN_RTR_69]
fortios_system_interface.VLAN_RTR_104: Creation complete after 1s [id=VLAN_RTR_104]
fortios_system_interface.VLAN_RTR_17: Creation complete after 1s [id=VLAN_RTR_17]
fortios_system_interface.VLAN_RTR_117: Creating...
fortios_system_interface.VLAN_RTR_66: Creation complete after 1s [id=VLAN_RTR_66]
fortios_system_interface.VLAN_RTR_42: Creation complete after 1s [id=VLAN_RTR_42]
fortios_system_interface.VLAN_RTR_150: Creation complete after 1s [id=VLAN_RTR_150]
fortios_system_interface.VLAN_RTR_20: Creation complete after 1s [id=VLAN_RTR_20]
fortios_system_interface.VLAN_RTR_24: Creation complete after 1s [id=VLAN_RTR_24]
fortios_system_interface.VLAN_RTR_82: Creation complete after 1s [id=VLAN_RTR_82]
fortios_system_interface.VLAN_RTR_37: Creating...
fortios_system_interface.VLAN_RTR_62: Creating...
fortios_system_interface.VLAN_RTR_58: Creating...
fortios_system_interface.VLAN_RTR_100: Creation complete after 1s [id=VLAN_RTR_100]
fortios_system_interface.VLAN_RTR_64: Creating...
fortios_system_interface.VLAN_RTR_134: Creating...
fortios_system_interface.VLAN_RTR_96: Creating...
fortios_system_interface.VLAN_RTR_144: Creating...
fortios_system_interface.VLAN_RTR_117: Creation complete after 1s [id=VLAN_RTR_117]
fortios_system_interface.VLAN_RTR_88: Creating...
fortios_system_interface.VLAN_RTR_148: Creating...
fortios_system_interface.VLAN_RTR_31: Creating...
fortios_system_interface.VLAN_RTR_37: Creation complete after 1s [id=VLAN_RTR_37]
fortios_system_interface.VLAN_RTR_62: Creation complete after 1s [id=VLAN_RTR_62]
fortios_system_interface.VLAN_RTR_146: Creating...
fortios_system_interface.VLAN_RTR_58: Creation complete after 0s [id=VLAN_RTR_58]
fortios_system_interface.VLAN_RTR_121: Creating...
fortios_system_interface.VLAN_RTR_64: Creation complete after 0s [id=VLAN_RTR_64]
fortios_system_interface.VLAN_RTR_38: Creating...
fortios_system_interface.VLAN_RTR_26: Creating...
fortios_system_interface.VLAN_RTR_144: Creation complete after 0s [id=VLAN_RTR_144]
fortios_system_interface.VLAN_RTR_96: Creation complete after 0s [id=VLAN_RTR_96]
fortios_system_interface.VLAN_RTR_148: Creation complete after 0s [id=VLAN_RTR_148]
fortios_system_interface.VLAN_RTR_133: Creating...
fortios_system_interface.VLAN_RTR_134: Creation complete after 0s [id=VLAN_RTR_134]
fortios_system_interface.VLAN_RTR_88: Creation complete after 0s [id=VLAN_RTR_88]
fortios_system_interface.VLAN_RTR_31: Creation complete after 0s [id=VLAN_RTR_31]
fortios_system_interface.VLAN_RTR_138: Creating...
fortios_system_interface.VLAN_RTR_16: Creating...
fortios_system_interface.VLAN_RTR_145: Creating...
fortios_system_interface.VLAN_RTR_146: Creation complete after 1s [id=VLAN_RTR_146]
fortios_system_interface.VLAN_RTR_121: Creation complete after 1s [id=VLAN_RTR_121]
fortios_system_interface.VLAN_RTR_38: Creation complete after 1s [id=VLAN_RTR_38]
fortios_system_interface.VLAN_RTR_26: Creation complete after 1s [id=VLAN_RTR_26]
fortios_system_interface.VLAN_RTR_132: Creating...
fortios_system_interface.VLAN_RTR_141: Creating...
fortios_system_interface.VLAN_RTR_133: Creation complete after 1s [id=VLAN_RTR_133]
fortios_system_interface.VLAN_RTR_32: Creating...
fortios_system_interface.VLAN_RTR_114: Creating...
fortios_system_interface.VLAN_RTR_138: Creation complete after 0s [id=VLAN_RTR_138]
fortios_system_interface.VLAN_RTR_60: Creating...
fortios_system_interface.VLAN_RTR_109: Creating...
fortios_system_interface.VLAN_RTR_55: Creating...
fortios_system_interface.VLAN_RTR_16: Creation complete after 0s [id=VLAN_RTR_16]
fortios_system_interface.VLAN_RTR_145: Creation complete after 0s [id=VLAN_RTR_145]
fortios_system_interface.VLAN_RTR_115: Creating...
fortios_system_interface.VLAN_RTR_132: Creation complete after 0s [id=VLAN_RTR_132]
fortios_system_interface.VLAN_RTR_56: Creating...
fortios_system_interface.VLAN_RTR_141: Creation complete after 0s [id=VLAN_RTR_141]
fortios_system_interface.VLAN_RTR_39: Creating...
fortios_system_interface.VLAN_RTR_114: Creation complete after 1s [id=VLAN_RTR_114]
fortios_system_interface.VLAN_RTR_131: Creating...
fortios_system_interface.VLAN_RTR_32: Creation complete after 1s [id=VLAN_RTR_32]
fortios_system_interface.VLAN_RTR_45: Creating...
fortios_system_interface.VLAN_RTR_60: Creation complete after 1s [id=VLAN_RTR_60]
fortios_system_interface.VLAN_RTR_55: Creation complete after 1s [id=VLAN_RTR_55]
fortios_system_interface.VLAN_RTR_5: Creating...
fortios_system_interface.VLAN_RTR_109: Creation complete after 1s [id=VLAN_RTR_109]
fortios_system_interface.VLAN_RTR_81: Creating...
fortios_system_interface.VLAN_RTR_115: Creation complete after 1s [id=VLAN_RTR_115]
fortios_system_interface.VLAN_RTR_56: Creation complete after 1s [id=VLAN_RTR_56]
fortios_system_interface.VLAN_RTR_39: Creation complete after 0s [id=VLAN_RTR_39]
fortios_system_interface.VLAN_RTR_65: Creating...
fortios_system_interface.VLAN_RTR_113: Creating...
fortios_system_interface.VLAN_RTR_80: Creating...
fortios_system_interface.VLAN_RTR_4: Creating...
fortios_system_interface.VLAN_RTR_131: Creation complete after 0s [id=VLAN_RTR_131]
fortios_system_interface.VLAN_RTR_45: Creation complete after 0s [id=VLAN_RTR_45]
fortios_system_interface.VLAN_RTR_84: Creating...
fortios_system_interface.VLAN_RTR_116: Creating...
fortios_system_interface.VLAN_RTR_5: Creation complete after 1s [id=VLAN_RTR_5]
fortios_system_interface.VLAN_RTR_65: Creation complete after 1s [id=VLAN_RTR_65]
fortios_system_interface.VLAN_RTR_95: Creating...
fortios_system_interface.VLAN_RTR_36: Creating...
fortios_system_interface.VLAN_RTR_94: Creating...
fortios_system_interface.VLAN_RTR_81: Creation complete after 1s [id=VLAN_RTR_81]
fortios_system_interface.VLAN_RTR_86: Creating...
fortios_system_interface.VLAN_RTR_4: Creation complete after 1s [id=VLAN_RTR_4]
fortios_system_interface.VLAN_RTR_113: Creation complete after 1s [id=VLAN_RTR_113]
fortios_system_interface.VLAN_RTR_80: Creation complete after 1s [id=VLAN_RTR_80]
fortios_system_interface.VLAN_RTR_34: Creating...
fortios_system_interface.VLAN_RTR_79: Creating...
fortios_system_interface.VLAN_RTR_6: Creating...
fortios_system_interface.VLAN_RTR_84: Creation complete after 1s [id=VLAN_RTR_84]
fortios_system_interface.VLAN_RTR_116: Creation complete after 0s [id=VLAN_RTR_116]
fortios_system_interface.VLAN_RTR_36: Creation complete after 0s [id=VLAN_RTR_36]
fortios_system_interface.VLAN_RTR_13: Creating...
fortios_system_interface.VLAN_RTR_142: Creating...
fortios_system_interface.VLAN_RTR_94: Creation complete after 0s [id=VLAN_RTR_94]
fortios_system_interface.VLAN_RTR_95: Creation complete after 0s [id=VLAN_RTR_95]
fortios_system_interface.VLAN_RTR_86: Creation complete after 0s [id=VLAN_RTR_86]
fortios_system_interface.VLAN_RTR_8: Creating...
fortios_system_interface.VLAN_RTR_73: Creating...
fortios_system_interface.VLAN_RTR_127: Creating...
fortios_system_interface.VLAN_RTR_79: Creation complete after 1s [id=VLAN_RTR_79]
fortios_system_interface.VLAN_RTR_149: Creating...
fortios_system_interface.VLAN_RTR_6: Creation complete after 1s [id=VLAN_RTR_6]
fortios_system_interface.VLAN_RTR_34: Creation complete after 1s [id=VLAN_RTR_34]
fortios_system_interface.VLAN_RTR_13: Creation complete after 1s [id=VLAN_RTR_13]
fortios_system_interface.VLAN_RTR_9: Creating...
fortios_system_interface.VLAN_RTR_28: Creating...
fortios_system_interface.VLAN_RTR_135: Creating...
fortios_system_interface.VLAN_RTR_8: Creation complete after 0s [id=VLAN_RTR_8]
fortios_system_interface.VLAN_RTR_67: Creating...
fortios_system_interface.VLAN_RTR_122: Creating...
fortios_system_interface.VLAN_RTR_142: Creation complete after 1s [id=VLAN_RTR_142]
fortios_system_interface.VLAN_RTR_127: Creation complete after 0s [id=VLAN_RTR_127]
fortios_system_interface.VLAN_RTR_73: Creation complete after 0s [id=VLAN_RTR_73]
fortios_system_interface.VLAN_RTR_149: Creation complete after 0s [id=VLAN_RTR_149]
fortios_system_interface.VLAN_RTR_89: Creating...
fortios_system_interface.VLAN_RTR_21: Creating...
fortios_system_interface.VLAN_RTR_139: Creating...
fortios_system_interface.VLAN_RTR_46: Creating...
fortios_system_interface.VLAN_RTR_28: Creation complete after 1s [id=VLAN_RTR_28]
fortios_system_interface.VLAN_RTR_9: Creation complete after 1s [id=VLAN_RTR_9]
fortios_system_interface.VLAN_RTR_135: Creation complete after 1s [id=VLAN_RTR_135]
fortios_system_interface.VLAN_RTR_33: Creating...
fortios_system_interface.VLAN_RTR_128: Creating...
fortios_system_interface.VLAN_RTR_3: Creating...
fortios_system_interface.VLAN_RTR_122: Creation complete after 1s [id=VLAN_RTR_122]
fortios_system_interface.VLAN_RTR_67: Creation complete after 1s [id=VLAN_RTR_67]
fortios_system_interface.VLAN_RTR_89: Creation complete after 0s [id=VLAN_RTR_89]
fortios_system_interface.VLAN_RTR_21: Creation complete after 0s [id=VLAN_RTR_21]
fortios_system_interface.VLAN_RTR_75: Creating...
fortios_system_interface.VLAN_RTR_27: Creating...
fortios_system_interface.VLAN_RTR_108: Creating...
fortios_system_interface.VLAN_RTR_139: Creation complete after 1s [id=VLAN_RTR_139]
fortios_system_interface.VLAN_RTR_46: Creation complete after 1s [id=VLAN_RTR_46]
fortios_system_interface.VLAN_RTR_33: Creation complete after 1s [id=VLAN_RTR_33]
fortios_system_interface.VLAN_RTR_90: Creating...
fortios_system_interface.VLAN_RTR_47: Creating...
fortios_system_interface.VLAN_RTR_85: Creating...
fortios_system_interface.VLAN_RTR_128: Creation complete after 1s [id=VLAN_RTR_128]
fortios_system_interface.VLAN_RTR_3: Creation complete after 1s [id=VLAN_RTR_3]
fortios_system_interface.VLAN_RTR_27: Creation complete after 1s [id=VLAN_RTR_27]
fortios_system_interface.VLAN_RTR_75: Creation complete after 1s [id=VLAN_RTR_75]
fortios_system_interface.VLAN_RTR_112: Creating...
fortios_system_interface.VLAN_RTR_97: Creating...
fortios_system_interface.VLAN_RTR_43: Creating...
fortios_system_interface.VLAN_RTR_19: Creating...
fortios_system_interface.VLAN_RTR_108: Creation complete after 0s [id=VLAN_RTR_108]
fortios_system_interface.VLAN_RTR_47: Creation complete after 0s [id=VLAN_RTR_47]
fortios_system_interface.VLAN_RTR_90: Creation complete after 0s [id=VLAN_RTR_90]
fortios_system_interface.VLAN_RTR_85: Creation complete after 0s [id=VLAN_RTR_85]
fortios_system_interface.VLAN_RTR_14: Creating...
fortios_system_interface.VLAN_RTR_120: Creating...
fortios_system_interface.VLAN_RTR_98: Creating...
fortios_system_interface.VLAN_RTR_11: Creating...
fortios_system_interface.VLAN_RTR_112: Creation complete after 1s [id=VLAN_RTR_112]
fortios_system_interface.VLAN_RTR_97: Creation complete after 1s [id=VLAN_RTR_97]
fortios_system_interface.VLAN_RTR_43: Creation complete after 1s [id=VLAN_RTR_43]
fortios_system_interface.VLAN_RTR_19: Creation complete after 1s [id=VLAN_RTR_19]
fortios_system_interface.VLAN_RTR_101: Creating...
fortios_system_interface.VLAN_RTR_23: Creating...
fortios_system_interface.VLAN_RTR_12: Creating...
fortios_system_interface.VLAN_RTR_61: Creating...
fortios_system_interface.VLAN_RTR_14: Creation complete after 0s [id=VLAN_RTR_14]
fortios_system_interface.VLAN_RTR_120: Creation complete after 0s [id=VLAN_RTR_120]
fortios_system_interface.VLAN_RTR_98: Creation complete after 0s [id=VLAN_RTR_98]
fortios_system_interface.VLAN_RTR_11: Creation complete after 0s [id=VLAN_RTR_11]
fortios_system_interface.VLAN_RTR_143: Creating...
fortios_system_interface.VLAN_RTR_53: Creating...
fortios_system_interface.VLAN_RTR_50: Creating...
fortios_system_interface.VLAN_RTR_29: Creating...
fortios_system_interface.VLAN_RTR_99: Creating...
fortios_system_interface.VLAN_RTR_23: Creation complete after 1s [id=VLAN_RTR_23]
fortios_system_interface.VLAN_RTR_101: Creation complete after 1s [id=VLAN_RTR_101]
fortios_system_interface.VLAN_RTR_12: Creation complete after 1s [id=VLAN_RTR_12]
fortios_system_interface.VLAN_RTR_61: Creation complete after 1s [id=VLAN_RTR_61]
fortios_system_interface.VLAN_RTR_93: Creating...
fortios_system_interface.VLAN_RTR_147: Creating...
fortios_system_interface.VLAN_RTR_130: Creating...
fortios_system_interface.VLAN_RTR_123: Creating...
fortios_system_interface.VLAN_RTR_53: Creation complete after 0s [id=VLAN_RTR_53]
fortios_system_interface.VLAN_RTR_143: Creation complete after 0s [id=VLAN_RTR_143]
fortios_system_interface.VLAN_RTR_10: Creating...
fortios_system_interface.VLAN_RTR_50: Creation complete after 1s [id=VLAN_RTR_50]
fortios_system_interface.VLAN_RTR_29: Creation complete after 1s [id=VLAN_RTR_29]
fortios_system_interface.VLAN_RTR_99: Creation complete after 1s [id=VLAN_RTR_99]
fortios_system_interface.VLAN_RTR_119: Creating...
fortios_system_interface.VLAN_RTR_7: Creating...
fortios_system_interface.VLAN_RTR_41: Creating...
fortios_system_interface.VLAN_RTR_87: Creating...
fortios_system_interface.VLAN_RTR_93: Creation complete after 1s [id=VLAN_RTR_93]
fortios_system_interface.VLAN_RTR_130: Creation complete after 1s [id=VLAN_RTR_130]
fortios_system_interface.VLAN_RTR_147: Creation complete after 1s [id=VLAN_RTR_147]
fortios_system_interface.VLAN_RTR_123: Creation complete after 1s [id=VLAN_RTR_123]
fortios_system_interface.VLAN_RTR_10: Creation complete after 0s [id=VLAN_RTR_10]
fortios_system_interface.VLAN_RTR_22: Creating...
fortios_system_interface.VLAN_RTR_118: Creating...
fortios_system_interface.VLAN_RTR_111: Creating...
fortios_system_interface.VLAN_RTR_35: Creating...
fortios_system_interface.VLAN_RTR_2: Creating...
fortios_system_interface.VLAN_RTR_119: Creation complete after 1s [id=VLAN_RTR_119]
fortios_system_interface.VLAN_RTR_7: Creation complete after 1s [id=VLAN_RTR_7]
fortios_system_interface.VLAN_RTR_41: Creation complete after 1s [id=VLAN_RTR_41]
fortios_system_interface.VLAN_RTR_87: Creation complete after 1s [id=VLAN_RTR_87]
fortios_system_interface.VLAN_RTR_22: Creation complete after 1s [id=VLAN_RTR_22]
fortios_system_interface.VLAN_RTR_74: Creating...
fortios_system_interface.VLAN_RTR_103: Creating...
fortios_system_interface.VLAN_RTR_140: Creating...
fortios_system_interface.VLAN_RTR_107: Creating...
fortios_system_interface.VLAN_RTR_48: Creating...
fortios_system_interface.VLAN_RTR_118: Creation complete after 2s [id=VLAN_RTR_118]
fortios_system_interface.VLAN_RTR_111: Creation complete after 1s [id=VLAN_RTR_111]
fortios_system_interface.VLAN_RTR_35: Creation complete after 1s [id=VLAN_RTR_35]
fortios_system_interface.VLAN_RTR_2: Creation complete after 1s [id=VLAN_RTR_2]
fortios_system_interface.VLAN_RTR_136: Creating...
fortios_system_interface.VLAN_RTR_51: Creating...
fortios_system_interface.VLAN_RTR_125: Creating...
fortios_system_interface.VLAN_RTR_110: Creating...
fortios_system_interface.VLAN_RTR_74: Creation complete after 1s [id=VLAN_RTR_74]
fortios_system_interface.VLAN_RTR_103: Creation complete after 1s [id=VLAN_RTR_103]
fortios_system_interface.VLAN_RTR_140: Creation complete after 1s [id=VLAN_RTR_140]
fortios_system_interface.VLAN_RTR_48: Creation complete after 0s [id=VLAN_RTR_48]
fortios_system_interface.VLAN_RTR_107: Creation complete after 0s [id=VLAN_RTR_107]
fortios_system_interface.VLAN_RTR_136: Creation complete after 0s [id=VLAN_RTR_136]
fortios_system_interface.VLAN_RTR_54: Creating...
fortios_system_interface.VLAN_RTR_76: Creating...
fortios_system_interface.VLAN_RTR_129: Creating...
fortios_system_interface.VLAN_RTR_15: Creating...
fortios_system_interface.VLAN_RTR_91: Creating...
fortios_system_interface.VLAN_RTR_40: Creating...
fortios_system_interface.VLAN_RTR_51: Creation complete after 1s [id=VLAN_RTR_51]
fortios_system_interface.VLAN_RTR_125: Creation complete after 1s [id=VLAN_RTR_125]
fortios_system_interface.VLAN_RTR_110: Creation complete after 1s [id=VLAN_RTR_110]
fortios_system_interface.VLAN_RTR_54: Creation complete after 1s [id=VLAN_RTR_54]
fortios_system_interface.VLAN_RTR_76: Creation complete after 1s [id=VLAN_RTR_76]
fortios_system_interface.VLAN_RTR_18: Creating...
fortios_system_interface.VLAN_RTR_83: Creating...
fortios_system_interface.VLAN_RTR_57: Creating...
fortios_system_interface.VLAN_RTR_49: Creating...
fortios_system_interface.VLAN_RTR_63: Creating...
fortios_system_interface.VLAN_RTR_129: Creation complete after 1s [id=VLAN_RTR_129]
fortios_system_interface.VLAN_RTR_15: Creation complete after 1s [id=VLAN_RTR_15]
fortios_system_interface.VLAN_RTR_91: Creation complete after 1s [id=VLAN_RTR_91]
fortios_system_interface.VLAN_RTR_40: Creation complete after 1s [id=VLAN_RTR_40]
fortios_system_interface.VLAN_RTR_18: Creation complete after 1s [id=VLAN_RTR_18]
fortios_system_interface.VLAN_RTR_83: Creation complete after 1s [id=VLAN_RTR_83]
fortios_system_interface.VLAN_RTR_72: Creating...
fortios_system_interface.VLAN_RTR_30: Creating...
fortios_system_interface.VLAN_RTR_105: Creating...
fortios_system_interface.VLAN_RTR_25: Creating...
fortios_system_interface.VLAN_RTR_92: Creating...
fortios_system_interface.VLAN_RTR_77: Creating...
fortios_system_interface.VLAN_RTR_57: Creation complete after 2s [id=VLAN_RTR_57]
fortios_system_interface.VLAN_RTR_49: Creation complete after 1s [id=VLAN_RTR_49]
fortios_system_interface.VLAN_RTR_63: Creation complete after 1s [id=VLAN_RTR_63]
fortios_system_interface.VLAN_RTR_72: Creation complete after 1s [id=VLAN_RTR_72]
fortios_system_interface.VLAN_RTR_30: Creation complete after 1s [id=VLAN_RTR_30]
fortios_system_interface.VLAN_RTR_105: Creation complete after 1s [id=VLAN_RTR_105]
fortios_system_interface.VLAN_RTR_52: Creating...
fortios_system_interface.VLAN_RTR_59: Creating...
fortios_system_interface.VLAN_RTR_78: Creating...
fortios_system_interface.VLAN_RTR_137: Creating...
fortios_system_interface.VLAN_RTR_124: Creating...
fortios_system_interface.VLAN_RTR_102: Creating...
fortios_system_interface.VLAN_RTR_25: Creation complete after 2s [id=VLAN_RTR_25]
fortios_system_interface.VLAN_RTR_92: Creation complete after 2s [id=VLAN_RTR_92]
fortios_system_interface.VLAN_RTR_77: Creation complete after 1s [id=VLAN_RTR_77]
fortios_system_interface.VLAN_RTR_52: Creation complete after 1s [id=VLAN_RTR_52]
fortios_system_interface.VLAN_RTR_59: Creation complete after 1s [id=VLAN_RTR_59]
fortios_system_interface.VLAN_RTR_1: Creating...
fortios_system_interface.VLAN_RTR_68: Creating...
fortios_system_interface.VLAN_RTR_70: Creating...
fortios_system_interface.VLAN_RTR_71: Creating...
fortios_system_interface.VLAN_RTR_126: Creating...
fortios_system_interface.VLAN_RTR_78: Creation complete after 1s [id=VLAN_RTR_78]
fortios_system_interface.VLAN_RTR_137: Creation complete after 1s [id=VLAN_RTR_137]
fortios_system_interface.VLAN_RTR_124: Creation complete after 1s [id=VLAN_RTR_124]
fortios_system_interface.VLAN_RTR_102: Creation complete after 1s [id=VLAN_RTR_102]
fortios_system_interface.VLAN_RTR_1: Creation complete after 0s [id=VLAN_RTR_1]
fortios_system_interface.VLAN_RTR_68: Creation complete after 0s [id=VLAN_RTR_68]
fortios_system_interface.VLAN_RTR_106: Creating...
fortios_system_interface.VLAN_RTR_70: Creation complete after 1s [id=VLAN_RTR_70]
fortios_system_interface.VLAN_RTR_71: Creation complete after 1s [id=VLAN_RTR_71]
fortios_system_interface.VLAN_RTR_126: Creation complete after 1s [id=VLAN_RTR_126]
fortios_system_interface.VLAN_RTR_106: Creation complete after 1s [id=VLAN_RTR_106]

Apply complete! Resources: 150 added, 0 changed, 0 destroyed.

```




**4 We can see that all interfaces have been successfully configured.**

![000](https://user-images.githubusercontent.com/49291382/98431387-d3588b00-20ef-11eb-83a0-11d1653afa28.jpg)
![111](https://user-images.githubusercontent.com/49291382/98431388-d81d3f00-20ef-11eb-9eed-5e9dc1104601.jpg)


**5 Solution:**
This problem should have nothing to do with the concurrency of terraform and FortiGate. It should be related to token, vdom and trusted hosts of RestAPI User. The following is the configuration of the three on my side, can you please check your configuration against it?

A Trusted Hosts and VDOM:
Refer to https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/guides/fgt_token to correctly configure the trusted ip of the rest api admin to which the token belongs. **This is particularly important.**
![1111](https://user-images.githubusercontent.com/49291382/98431788-7363e380-20f3-11eb-8a2d-2b7ccad5c494.png)


B root VDOM for REST API Admin:
FortiAPI always requires root vdom as a member of RestAPI Admin Virtual Domains
![222](https://user-images.githubusercontent.com/49291382/98431790-76f76a80-20f3-11eb-9d02-177cfcd5e501.png)

C  VDOM params for terraform:

According to https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs configure vdom for terraform:
```
provider "fortios" {
  hostname = "10.160.21.144"
  insecure = "true"
  token    = "ynypsNq8Hzs7dnff3NqjmwNQQ6pmhf"
  vdom     = "FGT_RTR"   <===================================
}
```
Hope the above can help.  Please let me know if you have any questions. Thanks!




